{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/contingency-tables.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Apr 2020, 21:29:16
{txt}
{com}. //_1
. display c(current_date)
{res}16 Apr 2020
{txt}
{com}. //_2
. display c(current_time)
{res}21:29:16
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. set obs 100 // 100 observations
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. //_5
. generate nickel = rbinomial(1, .75) // unfair nickel
{txt}
{com}. //_6
. generate quarter = rbinomial(1, .5) // fair quarter
{txt}
{com}. //_7
. tabulate nickel quarter, row col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}        quarter
    nickel {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}        15         18 {txt}{c |}{res}        33 
           {txt}{c |}{res}     45.45      54.55 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     29.41      36.73 {txt}{c |}{res}     33.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}        36         31 {txt}{c |}{res}        67 
           {txt}{c |}{res}     53.73      46.27 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     70.59      63.27 {txt}{c |}{res}     67.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        51         49 {txt}{c |}{res}       100 
           {txt}{c |}{res}     51.00      49.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. //_8
. * ssc install spineplot // mosaicplots (spineplots)
. //_9
. * ssc install scheme-burd, replace // BuRd graph scheme
. //_10
. spineplot nickel quarter, scheme(michigan)
{res}{txt}
{com}. //_11
. spineplot nickel quarter, scheme(burd)
{res}{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/contingency-tables.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Apr 2020, 21:29:20
{txt}{.-}
{smcl}
{txt}{sf}{ul off}