{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/contingency-tables/contingency-tables.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Apr 2020, 12:37:47
{txt}
{com}. //_1
. display c(current_date)
{res}17 Apr 2020
{txt}
{com}. //_2
. display c(current_time)
{res}12:37:47
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. set seed 3846
{txt}
{com}. //_5
. label define coin 1 "heads" 0 "tails" // define value label
{txt}
{com}. //_6
. set obs 1000 // 1000 observations
{txt}{p}
number of observations (_N)  was 0,
now 1,000
{p_end}

{com}. //_7
. * curiously it takes around 1000 obs for the proportions
. * below to "take hold"
. //_8
. generate nickel = rbinomial(1, .75) // unfair nickel
{txt}
{com}. //_9
. generate quarter = rbinomial(1, .5) // fair quarter
{txt}
{com}. //_10
. label values nickel quarter coin // assign value label
{txt}
{com}. //_11
. tabulate nickel quarter, row col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}        quarter
    nickel {c |}     tails      heads {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
     tails {c |}{res}       104        140 {txt}{c |}{res}       244 
           {txt}{c |}{res}     42.62      57.38 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     21.62      26.97 {txt}{c |}{res}     24.40 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     heads {c |}{res}       377        379 {txt}{c |}{res}       756 
           {txt}{c |}{res}     49.87      50.13 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     78.38      73.03 {txt}{c |}{res}     75.60 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       481        519 {txt}{c |}{res}     1,000 
           {txt}{c |}{res}     48.10      51.90 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. //_12
. * ssc install spineplot // mosaicplots (spineplots)
. //_13
. * ssc install scheme-burd, replace // BuRd graph scheme
. //_14
. spineplot nickel quarter, scheme(michigan)
{res}{txt}
{com}. //_15
. spineplot nickel quarter, scheme(burd)
{res}{txt}
{com}. //_16
. graph export nickel-quarter.png, width(1000) replace
{txt}(file nickel-quarter.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/contingency-tables/contingency-tables.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Apr 2020, 12:37:50
{txt}{.-}
{smcl}
{txt}{sf}{ul off}