{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/ordinal-multinomial-logistic-regression/ordinal-multinomial-logistic-regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 May 2020, 22:41:22
{txt}
{com}. //_1
. display c(current_date)
{res}14 May 2020
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. set maxvar 10000 // increase number of allowable variables

{txt}
{com}. //_4
. use "/Users/agrogan/Box Sync/DATA WAREHOUSE/General Social Survey/GSS7218_R1.DTA", clear
{txt}
{com}. //_5
. keep sex maeduc paeduc age degree
{txt}
{com}. //_6
. save GSSsmall.dta, replace
{txt}file GSSsmall.dta saved

{com}. //_7
. describe // describe the data

{txt}Contains data from {res}GSSsmall.dta
{txt}  obs:{res}        64,814                          
{txt} vars:{res}             5                          14 May 2020 22:41
{txt} size:{res}       324,070                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:AGE      }{bind:  }{res}{res}age of respondent{p_end}
{p 0 48}{bind:paeduc         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:LABK     }{bind:  }{res}{res}highest year school completed, father{p_end}
{p 0 48}{bind:maeduc         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:LABK     }{bind:  }{res}{res}highest year school completed, mother{p_end}
{p 0 48}{bind:degree         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:LABL     }{bind:  }{res}{res}r's highest degree{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:SEX      }{bind:  }{res}{res}respondents sex{p_end}
{txt}{hline}
Sorted by: 

{com}. //_8
. summarize 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}     64,586    46.09936     17.5347         18         89
{txt}{space 6}paeduc {c |}{res}     45,837    10.71026    4.342689          0         20
{txt}{space 6}maeduc {c |}{res}     53,870    10.85365    3.768792          0         20
{txt}{space 6}degree {c |}{res}     64,641     1.35858    1.175289          0          4
{txt}{space 9}sex {c |}{res}     64,814    1.558521    .4965673          1          2
{txt}
{com}. //_9
. tabulate degree

   {txt}r's highest {c |}
        degree {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
lt high school {c |}{res}     13,587       21.02       21.02
{txt}   high school {c |}{res}     33,195       51.35       72.37
{txt}junior college {c |}{res}      3,668        5.67       78.05
{txt}      bachelor {c |}{res}      9,475       14.66       92.70
{txt}      graduate {c |}{res}      4,716        7.30      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     64,641      100.00
{txt}
{com}. //_10
. ologit degree sex age paeduc maeduc

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-56160.846}  
Iteration 1:{space 3}log likelihood = {res:-50678.236}  
Iteration 2:{space 3}log likelihood = {res:-50453.401}  
Iteration 3:{space 3}log likelihood = {res:-50452.782}  
Iteration 4:{space 3}log likelihood = {res:-50452.782}  
{res}
{txt}Ordered logistic regression{col 49}Number of obs{col 67}= {res}    42,583
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}  11416.13
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-50452.782{txt}{col 49}Pseudo R2{col 67}= {res}    0.1016

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      degree{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}{col 14}{res}{space 2}-.0756255{col 26}{space 2} .0188243{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4}-.1125204{col 67}{space 3}-.0387307
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0124686{col 26}{space 2} .0006014{col 37}{space 1}   20.73{col 46}{space 3}0.000{col 54}{space 4} .0112899{col 67}{space 3} .0136474
{txt}{space 6}paeduc {c |}{col 14}{res}{space 2}  .151748{col 26}{space 2} .0031156{col 37}{space 1}   48.71{col 46}{space 3}0.000{col 54}{space 4} .1456416{col 67}{space 3} .1578545
{txt}{space 6}maeduc {c |}{col 14}{res}{space 2}  .157931{col 26}{space 2} .0036724{col 37}{space 1}   43.00{col 46}{space 3}0.000{col 54}{space 4} .1507332{col 67}{space 3} .1651288
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       /cut1 {c |}{col 14}{res}{space 2} 1.686014{col 26}{space 2} .0565978{col 54}{space 4} 1.575084{col 67}{space 3} 1.796944
{txt}       /cut2 {c |}{col 14}{res}{space 2} 4.710994{col 26}{space 2}   .06085{col 54}{space 4}  4.59173{col 67}{space 3} 4.830258
{txt}       /cut3 {c |}{col 14}{res}{space 2} 5.061419{col 26}{space 2} .0614286{col 54}{space 4} 4.941021{col 67}{space 3} 5.181817
{txt}       /cut4 {c |}{col 14}{res}{space 2} 6.542017{col 26}{space 2} .0645181{col 54}{space 4} 6.415564{col 67}{space 3}  6.66847
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_11
. ologit degree sex age paeduc maeduc, or

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-56160.846}  
Iteration 1:{space 3}log likelihood = {res:-50678.236}  
Iteration 2:{space 3}log likelihood = {res:-50453.401}  
Iteration 3:{space 3}log likelihood = {res:-50452.782}  
Iteration 4:{space 3}log likelihood = {res:-50452.782}  
{res}
{txt}Ordered logistic regression{col 49}Number of obs{col 67}= {res}    42,583
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}  11416.13
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-50452.782{txt}{col 49}Pseudo R2{col 67}= {res}    0.1016

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      degree{col 14}{c |} Odds Ratio{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}{col 14}{res}{space 2} .9271633{col 26}{space 2} .0174532{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4} .8935791{col 67}{space 3} .9620098
{txt}{space 9}age {c |}{col 14}{res}{space 2} 1.012547{col 26}{space 2}  .000609{col 37}{space 1}   20.73{col 46}{space 3}0.000{col 54}{space 4} 1.011354{col 67}{space 3} 1.013741
{txt}{space 6}paeduc {c |}{col 14}{res}{space 2} 1.163867{col 26}{space 2} .0036261{col 37}{space 1}   48.71{col 46}{space 3}0.000{col 54}{space 4} 1.156782{col 67}{space 3} 1.170996
{txt}{space 6}maeduc {c |}{col 14}{res}{space 2} 1.171085{col 26}{space 2} .0043007{col 37}{space 1}   43.00{col 46}{space 3}0.000{col 54}{space 4} 1.162686{col 67}{space 3} 1.179545
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       /cut1 {c |}{col 14}{res}{space 2} 1.686014{col 26}{space 2} .0565978{col 54}{space 4} 1.575084{col 67}{space 3} 1.796944
{txt}       /cut2 {c |}{col 14}{res}{space 2} 4.710994{col 26}{space 2}   .06085{col 54}{space 4}  4.59173{col 67}{space 3} 4.830258
{txt}       /cut3 {c |}{col 14}{res}{space 2} 5.061419{col 26}{space 2} .0614286{col 54}{space 4} 4.941021{col 67}{space 3} 5.181817
{txt}       /cut4 {c |}{col 14}{res}{space 2} 6.542017{col 26}{space 2} .0645181{col 54}{space 4} 6.415564{col 67}{space 3}  6.66847
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {help eform_option:Estimates are transformed} only in the first equation.{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/ordinal-multinomial-logistic-regression/ordinal-multinomial-logistic-regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 May 2020, 22:41:24
{txt}{.-}
{smcl}
{txt}{sf}{ul off}