{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/data-visualization-with-Stata/data-visualization-with-Stata.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}13 Sep 2020, 12:26:04
{txt}
{com}. //_1
. display c(current_date)
{res}13 Sep 2020
{txt}
{com}. //_2
. use gutten.dta, clear
{txt}
{com}. //_3
. egen ageMEAN = mean(age_base)
{txt}
{com}. //_4
. generate ageCENTERED = age_base - ageMEAN
{txt}
{com}. //_5
. histogram height, title("Tree Height")
{txt}(bin={res}30{txt}, start={res}1.5{txt}, width={res}1.4{txt})
{res}{txt}
{com}. //_6
. graph export myhistogram.png, width(500) replace
{txt}(file myhistogram.png written in PNG format)

{com}. //_7
. graph bar, over(location) title("Tree Location")
{res}{txt}
{com}. //_8
. graph export mybargraph.png, width(500) replace
{txt}(file mybargraph.png written in PNG format)

{com}. //_9
. twoway scatter height age_base, title("Tree Height by Age")
{res}{txt}
{com}. //_10
. graph export myscatter.png, width(500) replace
{txt}(file myscatter.png written in PNG format)

{com}. //_11
. graph bar, over(site) over(location) title("Tree Site Growth Quality by Location")
{res}{txt}
{com}. //_12
. graph export mybargraph2.png, width(500) replace
{txt}(file mybargraph2.png written in PNG format)

{com}. //_13
. graph bar height, over(location) title("Tree Height by Location")
{res}{txt}
{com}. //_14
. graph export mybargraph3.png, width(500) replace
{txt}(file mybargraph3.png written in PNG format)

{com}. //_15
. twoway scatter height age_base, title("Tree Height by Age") scheme(michigan)
{res}{txt}
{com}. //_16
. graph export myscatterM.png, width(500) replace
{txt}(file myscatterM.png written in PNG format)

{com}. //_17
. twoway scatter height age_base, title("Tree Height by Age") scheme(lean2)
{res}{txt}
{com}. //_18
. graph export myscatterL.png, width(500) replace
{txt}(file myscatterL.png written in PNG format)

{com}. //_19
. graph bar height, over(location) asyvars title("Tree Height by Location") scheme(michigan)
{res}{txt}
{com}. //_20
. graph export mybarM.png, width(500) replace
{txt}(file mybarM.png written in PNG format)

{com}. //_21
. graph bar height, over(location) asyvars title("Tree Height by Location") scheme(lean2)
{res}{txt}
{com}. //_22
. graph export mybarL.png, width(500) replace
{txt}(file mybarL.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/data-visualization-with-Stata/data-visualization-with-Stata.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}13 Sep 2020, 12:26:15
{txt}{.-}
{smcl}
{txt}{sf}{ul off}