{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/count-regression/count-regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 May 2020, 20:47:53
{txt}
{com}. //_1
. display c(current_date)
{res}27 May 2020
{txt}
{com}. //_2
. clear all // clear all for simulated data
{res}{txt}
{com}. //_3
. set obs 1000 // number of observations
{txt}{p}
number of observations (_N)  was 0,
now 1,000
{p_end}

{com}. //_4
. generate x = rnormal() // normally distributed random variable
{txt}
{com}. //_5
. histogram x, title("Normally Distributed Random Variable") scheme(burd)
{txt}(bin={res}29{txt}, start={res}-2.7807415{txt}, width={res}.21580977{txt})
{res}{txt}
{com}. //_6
. graph export myhistogram.png, width(500) replace
{txt}(file myhistogram.png written in PNG format)

{com}. //_7
. generate w = rpoisson(.5)
{txt}
{com}. //_8
. histogram w, title("Poisson Distributed Random Variable") scheme(burd)
{txt}(bin={res}29{txt}, start={res}0{txt}, width={res}.13793103{txt})
{res}{txt}
{com}. //_9
. graph export myhistogram2.png, width(500) replace
{txt}(file myhistogram2.png written in PNG format)

{com}. //_10
. clear all
{res}{txt}
{com}. //_11
. set obs 20
{txt}{p}
number of observations (_N)  was 0,
now 20
{p_end}

{com}. //_12
. generate field = _n // field number
{txt}
{com}. //_13
. generate mycount = rpoisson(1)
{txt}
{com}. //_14
. expand mycount // create individual observations
{txt}(7 zero counts ignored; observations not deleted)
(6 observations created)

{com}. //_15
. generate x = runiform(1,10) // random x coordinate
{txt}
{com}. //_16
. generate y =runiform(1,10) // random y coordinate
{txt}
{com}. //_17
. generate mylabel = "ðŸ¦†"
{txt}
{com}. //_18
. twoway scatter y x, ///
> by(field, title("Randomly Located Ducks")) ///
> mlab(mylabel) mlabsize(vlarge) ///
> msymbol(none)  ///
> legend(order(1 "ðŸ¦† Duck")) ///
> scheme(sj)
{res}{txt}
{com}. //_19
. graph export ducks.png, width(1000) replace
{txt}(file ducks.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/count-regression/count-regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}27 May 2020, 20:48:05
{txt}{.-}
{smcl}
{txt}{sf}{ul off}