{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/count-regression/count-regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Jun 2020, 08:57:19
{txt}
{com}. //_1
. display c(current_date)
{res}14 Jun 2020
{txt}
{com}. //_2
. clear all // clear all for simulated data
{res}{txt}
{com}. //_3
. set obs 1000 // number of observations
{txt}{p}
number of observations (_N)  was 0,
now 1,000
{p_end}

{com}. //_4
. generate x = rnormal() // normally distributed random variable
{txt}
{com}. //_5
. histogram x, title("Normally Distributed Random Variable") scheme(burd)
{txt}(bin={res}29{txt}, start={res}-3.3779824{txt}, width={res}.21597276{txt})
{res}{txt}
{com}. //_6
. graph export myhistogram.png, width(500) replace
{txt}(file myhistogram.png written in PNG format)

{com}. //_7
. generate w = rpoisson(.5)
{txt}
{com}. //_8
. histogram w, title("Poisson Distributed Random Variable") scheme(burd)
{txt}(bin={res}29{txt}, start={res}0{txt}, width={res}.13793103{txt})
{res}{txt}
{com}. //_9
. graph export myhistogram2.png, width(500) replace
{txt}(file myhistogram2.png written in PNG format)

{com}. //_10
. clear all
{res}{txt}
{com}. //_11
. set obs 20
{txt}{p}
number of observations (_N)  was 0,
now 20
{p_end}

{com}. //_12
. generate field = _n // field number
{txt}
{com}. //_13
. generate mycount = rpoisson(1)
{txt}
{com}. //_14
. expand mycount // create individual observations
{txt}(6 zero counts ignored; observations not deleted)
(7 observations created)

{com}. //_15
. generate x = runiform(1,10) // random x coordinate
{txt}
{com}. //_16
. generate y =runiform(1,10) // random y coordinate
{txt}
{com}. //_17
. generate mylabel = "ðŸ¦†"
{txt}
{com}. //_18
. twoway scatter y x, ///
> by(field, title("Randomly Located Ducks")) ///
> mlab(mylabel) mlabsize(vlarge) ///
> msymbol(none)  ///
> legend(order(1 "ðŸ¦† Duck")) ///
> scheme(burd) plotr(fcolor(olive_teal))
{res}{txt}
{com}. //_19
. graph export ducks.png, width(1000) replace
{txt}(file ducks.png written in PNG format)

{com}. //_20
. clear all
{res}{txt}
{com}. //_21
. set maxvar 10000

{txt}
{com}. //_22
. use "/Users/agrogan/Box Sync/DATA WAREHOUSE/General Social Survey/GSS7218_R1.DTA", clear
{txt}
{com}. //_23
. codebook numprobs // data from 2002

{txt}{hline}
{res}numprobs{right:how many friends close to discuss problems }
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})
{ralign 22:label}:  {res:LABJP}, but {res:33} nonmissing values are not labeled

{col 18}range:  [{res}0{txt},{res}96{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}34{col 51}{txt}missing .:  {res}0{txt}/{res}64,814
{col 8}{txt}unique mv codes:  {res}3{col 50}{txt}missing .*:  {res}62,141{txt}/{res}64,814

{txt}{ralign 23: examples:}{col 26}{res}.i{col 32}{txt}IAP
{ralign 23: }{col 26}{res}.i{col 32}{txt}IAP
{ralign 23: }{col 26}{res}.i{col 32}{txt}IAP
{ralign 23: }{col 26}{res}.i{col 32}{txt}IAP

{com}. //_24
. generate coninc_10K = coninc / 10000 // $10K chunks
{txt}(6,520 missing values generated)

{com}. //_25
. poisson numprobs coninc_10K i.race sex age
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-13850.015}  
Iteration 1:{space 3}log likelihood = {res:-13850.011}  
Iteration 2:{space 3}log likelihood = {res:-13850.011}  
{res}
{txt}Poisson regression{col 49}Number of obs{col 67}= {res}     2,406
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1035.88
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-13850.011{txt}{col 49}Pseudo R2{col 67}= {res}    0.0360

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    numprobs{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}coninc_10K {c |}{col 14}{res}{space 2} .0319119{col 26}{space 2} .0015338{col 37}{space 1}   20.81{col 46}{space 3}0.000{col 54}{space 4} .0289058{col 67}{space 3}  .034918
{txt}{space 12} {c |}
{space 8}race {c |}
{space 6}black  {c |}{col 14}{res}{space 2}-.4359226{col 26}{space 2} .0254022{col 37}{space 1}  -17.16{col 46}{space 3}0.000{col 54}{space 4}-.4857101{col 67}{space 3}-.3861351
{txt}{space 6}other  {c |}{col 14}{res}{space 2}-.3791775{col 26}{space 2} .0344591{col 37}{space 1}  -11.00{col 46}{space 3}0.000{col 54}{space 4}-.4467161{col 67}{space 3}-.3116389
{txt}{space 12} {c |}
{space 9}sex {c |}{col 14}{res}{space 2} .1335163{col 26}{space 2} .0145586{col 37}{space 1}    9.17{col 46}{space 3}0.000{col 54}{space 4}  .104982{col 67}{space 3} .1620507
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0007319{col 26}{space 2} .0004376{col 37}{space 1}   -1.67{col 46}{space 3}0.094{col 54}{space 4}-.0015895{col 67}{space 3} .0001257
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.812817{col 26}{space 2} .0332514{col 37}{space 1}   54.52{col 46}{space 3}0.000{col 54}{space 4} 1.747646{col 67}{space 3} 1.877989
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_26
. poisson, irr

{txt}Poisson regression{col 49}Number of obs{col 67}= {res}     2,406
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}   1035.88
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-13850.011{txt}{col 49}Pseudo R2{col 67}= {res}    0.0360

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    numprobs{col 14}{c |}        IRR{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}coninc_10K {c |}{col 14}{res}{space 2} 1.032427{col 26}{space 2} .0015835{col 37}{space 1}   20.81{col 46}{space 3}0.000{col 54}{space 4} 1.029328{col 67}{space 3} 1.035535
{txt}{space 12} {c |}
{space 8}race {c |}
{space 6}black  {c |}{col 14}{res}{space 2} .6466678{col 26}{space 2} .0164268{col 37}{space 1}  -17.16{col 46}{space 3}0.000{col 54}{space 4} .6152602{col 67}{space 3} .6796787
{txt}{space 6}other  {c |}{col 14}{res}{space 2} .6844241{col 26}{space 2} .0235846{col 37}{space 1}  -11.00{col 46}{space 3}0.000{col 54}{space 4} .6397255{col 67}{space 3} .7322459
{txt}{space 12} {c |}
{space 9}sex {c |}{col 14}{res}{space 2}  1.14284{col 26}{space 2} .0166382{col 37}{space 1}    9.17{col 46}{space 3}0.000{col 54}{space 4} 1.110691{col 67}{space 3}  1.17592
{txt}{space 9}age {c |}{col 14}{res}{space 2} .9992684{col 26}{space 2} .0004372{col 37}{space 1}   -1.67{col 46}{space 3}0.094{col 54}{space 4} .9984118{col 67}{space 3} 1.000126
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.127687{col 26}{space 2} .2037541{col 37}{space 1}   54.52{col 46}{space 3}0.000{col 54}{space 4} 5.741071{col 67}{space 3} 6.540338
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {res:_cons} estimates baseline incidence rate{txt}.{p_end}

{com}. //_27
. nbreg numprobs coninc_10K i.race sex age

{txt}Fitting Poisson model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-13850.015}  
Iteration 1:{space 3}log likelihood = {res:-13850.011}  
Iteration 2:{space 3}log likelihood = {res:-13850.011}  
{res}
{txt}Fitting constant-only model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -7577.985}  
Iteration 1:{space 3}log likelihood = {res:-7561.8388}  
Iteration 2:{space 3}log likelihood = {res:  -7561.83}  
Iteration 3:{space 3}log likelihood = {res:  -7561.83}  
{res}
{txt}Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7496.5295}  
Iteration 1:{space 3}log likelihood = {res:-7493.7917}  
Iteration 2:{space 3}log likelihood = {res:-7493.7857}  
Iteration 3:{space 3}log likelihood = {res:-7493.7857}  
{res}
{txt}Negative binomial regression{col 49}Number of obs{col 67}= {res}     2,406
{txt}{col 49}LR chi2({res}5{txt}){col 67}= {res}    136.09
{txt}{col 1}Dispersion{col 16}= {res}mean{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-7493.7857{txt}{col 49}Pseudo R2{col 67}= {res}    0.0090

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    numprobs{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 2}coninc_10K {c |}{col 14}{res}{space 2} .0306399{col 26}{space 2} .0045093{col 37}{space 1}    6.79{col 46}{space 3}0.000{col 54}{space 4} .0218017{col 67}{space 3}  .039478
{txt}{space 12} {c |}
{space 8}race {c |}
{space 6}black  {c |}{col 14}{res}{space 2} -.432147{col 26}{space 2} .0596002{col 37}{space 1}   -7.25{col 46}{space 3}0.000{col 54}{space 4}-.5489613{col 67}{space 3}-.3153328
{txt}{space 6}other  {c |}{col 14}{res}{space 2}-.3843031{col 26}{space 2} .0830998{col 37}{space 1}   -4.62{col 46}{space 3}0.000{col 54}{space 4}-.5471758{col 67}{space 3}-.2214304
{txt}{space 12} {c |}
{space 9}sex {c |}{col 14}{res}{space 2} .1154665{col 26}{space 2} .0393671{col 37}{space 1}    2.93{col 46}{space 3}0.003{col 54}{space 4} .0383084{col 67}{space 3} .1926246
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0009527{col 26}{space 2} .0011445{col 37}{space 1}   -0.83{col 46}{space 3}0.405{col 54}{space 4}-.0031958{col 67}{space 3} .0012904
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.857757{col 26}{space 2} .0873184{col 37}{space 1}   21.28{col 46}{space 3}0.000{col 54}{space 4} 1.686616{col 67}{space 3} 2.028898
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnalpha {c |}{col 14}{res}{space 2}-.2378643{col 26}{space 2} .0317921{col 54}{space 4}-.3001755{col 67}{space 3} -.175553
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       alpha {c |}{col 14}{res}{space 2} .7883097{col 26}{space 2}  .025062{col 54}{space 4} .7406882{col 67}{space 3} .8389929
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
LR test of alpha=0: {help j_chibar##|_new:chibar2(01) = }{res}1.3e+04{col 56}{txt}Prob >= chibar2 = {res}0.000
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/count-regression/count-regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Jun 2020, 08:57:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}