{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-regression/logistic-regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Jun 2020, 08:58:10
{txt}
{com}. //_1
. display c(current_date)
{res} 2 Jun 2020
{txt}
{com}. //_2
. use "/Users/agrogan/Box Sync/DATA WAREHOUSE/General Social Survey Panel Data/GSS_panel2010w123_R6 - stata.dta", clear 
{txt}( )

{com}. //_3
. codebook happy_3 // what does this variable look like?

{txt}{hline}
{res}happy_3{right:happy_3: GENERAL HAPPINESS}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})
{ralign 22:label}:  {res:HAPPY_3}

{col 18}range:  [{res}1{txt},{res}3{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}3{col 51}{txt}missing .:  {res}0{txt}/{res}2,044
{col 8}{txt}unique mv codes:  {res}3{col 50}{txt}missing .*:  {res}742{txt}/{res}2,044

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}       391{col 33}       1{col 43}{txt}VERY HAPPY
{col 21}{res}       758{col 33}       2{col 43}{txt}PRETTY HAPPY
{col 21}{res}       153{col 33}       3{col 43}{txt}NOT TOO HAPPY
{col 21}{res}         1{col 33}      .d{col 43}{txt}DK
{col 21}{res}       740{col 33}      .i{col 43}{txt}IAP
{col 21}{res}         1{col 33}      .n{col 43}{txt}NA

{com}. //_4
. recode happy_3 (1/2 = 1)(3=0), generate(happy_3_D)
{txt}(911 differences between happy_3 and happy_3_D)

{com}. //_5
. tabulate happy_3 happy_3_D // double check

              {txt}{c |}   RECODE of happy_3
     happy_3: {c |}   (happy_3: GENERAL
      GENERAL {c |}      HAPPINESS)
    HAPPINESS {c |}         0          1 {c |}     Total
{hline 14}{c +}{hline 22}{c +}{hline 10}
   VERY HAPPY {c |}{res}         0        391 {txt}{c |}{res}       391 
{txt} PRETTY HAPPY {c |}{res}         0        758 {txt}{c |}{res}       758 
{txt}NOT TOO HAPPY {c |}{res}       153          0 {txt}{c |}{res}       153 
{txt}{hline 14}{c +}{hline 22}{c +}{hline 10}
        Total {c |}{res}       153      1,149 {txt}{c |}{res}     1,302 
{txt}
{com}. //_6
. generate coninc_3_10K = coninc_3 / 10000
{txt}(820 missing values generated)

{com}. //_7
. label variable coninc_3_10K "Income 10K Chunks"
{txt}
{com}. //_8
. keep happy_3 happy_3_D coninc_3 coninc_3_10K // keep only some variables
{txt}
{com}. //_9
. save GSSsmall.dta, replace
{txt}file GSSsmall.dta saved

{com}. //_10
. twoway scatter happy_3_D coninc_3, scheme(burd) jitter(5)
{res}{txt}
{com}. //_11
. graph export happiness-income.png, width(500) replace
{txt}(file happiness-income.png written in PNG format)

{com}. //_12
. regress happy_3_D coninc_3_10K

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,223
{txt}{hline 13}{c +}{hline 34}   F(1, 1221)      = {res}    22.87
{txt}       Model {c |} {res} 2.26477699         1  2.26477699   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 120.937185     1,221  .099047654   {txt}R-squared       ={res}    0.0184
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0176
{txt}       Total {c |} {res} 123.201962     1,222  .100819936   {txt}Root MSE        =   {res} .31472

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   happy_3_D{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
coninc_3_10K {c |}{col 14}{res}{space 2} .0096934{col 26}{space 2} .0020272{col 37}{space 1}    4.78{col 46}{space 3}0.000{col 54}{space 4} .0057163{col 67}{space 3} .0136705
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8368664{col 26}{space 2} .0137133{col 37}{space 1}   61.03{col 46}{space 3}0.000{col 54}{space 4} .8099622{col 67}{space 3} .8637706
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_13
. clear all
{res}{txt}
{com}. //_14
. set obs 100 // 100 observations
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. //_15
. generate z = runiform(-5, 5) // randomly distributed z scores
{txt}
{com}. //_16
. generate mynormaldensities = normalden(z) // normal densities
{txt}
{com}. //_17
. generate myprobabilities = normal(z) // cumulative normal probabilities
{txt}
{com}. //_18
. twoway scatter mynormaldensities myprobabilities z, scheme(michigan)
{res}{txt}
{com}. //_19
. graph export normal.png, width(500) replace
{txt}(file normal.png written in PNG format)

{com}. //_20
. use GSSsmall.dta, clear
{txt}( )

{com}. //_21
. probit happy_3_D coninc_3_10K

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-433.05123}  
Iteration 1:{space 3}log likelihood = {res:-419.92819}  
Iteration 2:{space 3}log likelihood = {res:-419.73499}  
Iteration 3:{space 3}log likelihood = {res:-419.73484}  
Iteration 4:{space 3}log likelihood = {res:-419.73484}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     1,223
{txt}{col 49}LR chi2({res}1{txt}){col 67}= {res}     26.63
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-419.73484{txt}{col 49}Pseudo R2{col 67}= {res}    0.0308

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   happy_3_D{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
coninc_3_10K {c |}{col 14}{res}{space 2} .0643046{col 26}{space 2}  .013517{col 37}{space 1}    4.76{col 46}{space 3}0.000{col 54}{space 4} .0378119{col 67}{space 3} .0907974
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .9244086{col 26}{space 2} .0721521{col 37}{space 1}   12.81{col 46}{space 3}0.000{col 54}{space 4} .7829931{col 67}{space 3} 1.065824
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_22
. clear all
{res}{txt}
{com}. //_23
. set obs 100 // 100 observations
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. //_24
. generate z = runiform(-5, 5) // randomly distributed z scores
{txt}
{com}. //_25
. generate mylogisticdensities = logisticden(z) // logistic densities
{txt}
{com}. //_26
. generate mylogisticprobabilities = logistic(z) // cumulative logistic probabilities
{txt}
{com}. //_27
. twoway scatter mylogisticdensities mylogisticprobabilities z, scheme(michigan)
{res}{txt}
{com}. //_28
. graph export logistic.png, width(500) replace
{txt}(file logistic.png written in PNG format)

{com}. //_29
. use GSSsmall.dta, clear
{txt}( )

{com}. //_30
. logit happy_3_D coninc_3_10K

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-433.05123}  
Iteration 1:{space 3}log likelihood = {res:-420.07608}  
Iteration 2:{space 3}log likelihood = {res:-419.28644}  
Iteration 3:{space 3}log likelihood = {res:-419.28513}  
Iteration 4:{space 3}log likelihood = {res:-419.28513}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     1,223
{txt}{col 49}LR chi2({res}1{txt}){col 67}= {res}     27.53
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-419.28513{txt}{col 49}Pseudo R2{col 67}= {res}    0.0318

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   happy_3_D{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
coninc_3_10K {c |}{col 14}{res}{space 2} .1343328{col 26}{space 2} .0293318{col 37}{space 1}    4.58{col 46}{space 3}0.000{col 54}{space 4} .0768437{col 67}{space 3}  .191822
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.484066{col 26}{space 2} .1381599{col 37}{space 1}   10.74{col 46}{space 3}0.000{col 54}{space 4} 1.213277{col 67}{space 3} 1.754854
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_31
. quietly probit happy_3_D coninc_3_10K
{txt}
{com}. //_32
. est store myprobit
{txt}
{com}. //_33
. quietly logit happy_3_D coninc_3_10K
{txt}
{com}. //_34
. est store mylogit
{txt}
{com}. //_35
. est table myprobit mylogit
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:myprobit} {space 1} {center 10:mylogit} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}coninc_3_10K {c |}{res} {ralign 10:.06430462}{txt} {space 1}{res} {ralign 10:.13433285}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.92440858}{txt} {space 1}{res} {ralign 10:1.4840659}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-regression/logistic-regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 Jun 2020, 08:58:16
{txt}{.-}
{smcl}
{txt}{sf}{ul off}