{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-regression/logistic-regression.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Jul 2020, 17:43:02
{txt}
{com}. //_1
. display c(current_date)
{res}22 Jul 2020
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. set maxvar 10000

{txt}
{com}. //_4
. use "/Users/agrogan/Box Sync/DATA WAREHOUSE/General Social Survey/GSS7218_R1.DTA", clear
{txt}
{com}. //_5
. * keep if year == 2018 // keep only most recent year
. //_6
. codebook polviews // what does this variable look like?

{txt}{hline}
{res}polviews{right:think of self as liberal or conservative}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})
{ralign 22:label}:  {res:POLVIEWS}

{col 18}range:  [{res}1{txt},{res}7{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}7{col 51}{txt}missing .:  {res}0{txt}/{res}64,814
{col 8}{txt}unique mv codes:  {res}3{col 50}{txt}missing .*:  {res}9,486{txt}/{res}64,814

{txt}{col 13}tabulation:  Freq.   Numeric  Label
{col 21}{res}     1,682{col 33}       1{col 43}{txt}extremely liberal
{col 21}{res}     6,514{col 33}       2{col 43}{txt}liberal
{col 21}{res}     7,010{col 33}       3{col 43}{txt}slightly liberal
{col 21}{res}    21,370{col 33}       4{col 43}{txt}moderate
{col 21}{res}     8,690{col 33}       5{col 43}{txt}slghtly conservative
{col 21}{res}     8,230{col 33}       6{col 43}{txt}conservative
{col 21}{res}     1,832{col 33}       7{col 43}{txt}extrmly conservative
{col 21}{res}     2,326{col 33}      .d{col 43}{txt}DK
{col 21}{res}     6,777{col 33}      .i{col 43}{txt}IAP
{col 21}{res}       383{col 33}      .n{col 43}{txt}NA

{com}. //_7
. recode polviews (1/3 = 1)(4/7 = 0), generate(liberal) // dichotomize
{txt}(53646 differences between polviews and liberal)

{com}. //_8
. generate coninc_10K = coninc / 10000 // income in $10K chunks
{txt}(6,520 missing values generated)

{com}. //_9
. label variable coninc_10K "Income 10K Chunks"
{txt}
{com}. //_10
. egen income_group = cut(coninc), group(3) // divide income into three groups
{txt}(6520 missing values generated)

{com}. //_11
. drop if class == 5
{txt}(1 observation deleted)

{com}. //_12
. recode hispanic (1 = 1)(else = 0), generate(latinx) // Latinx
{txt}(41258 differences between hispanic and latinx)

{com}. //_13
. keep year polviews liberal ///
> race latinx class ///
> coninc coninc_10K income_group // keep only some variables
{txt}
{com}. //_14
. save GSSsmall.dta, replace
{txt}file GSSsmall.dta saved

{com}. //_15
. twoway qfit liberal coninc, lwidth(thick) scheme(burd) ///
> title("Liberal Attitudes by Income") 
{res}{txt}
{com}. //_16
. graph export liberal-income.png, width(500) replace
{txt}(file liberal-income.png written in PNG format)

{com}. //_17
. regress liberal i.race i.income_group

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    50,191
{txt}{hline 13}{c +}{hline 34}   F(4, 50186)     = {res}    64.96
{txt}       Model {c |} {res} 52.1435055         4  13.0358764   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 10071.8678    50,186  .200690786   {txt}R-squared       ={res}    0.0052
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0051
{txt}       Total {c |} {res} 10124.0113    50,190  .201713713   {txt}Root MSE        =   {res} .44799

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     liberal{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}race {c |}
{space 6}black  {c |}{col 14}{res}{space 2} .0857774{col 26}{space 2} .0059616{col 37}{space 1}   14.39{col 46}{space 3}0.000{col 54}{space 4} .0740926{col 67}{space 3} .0974621
{txt}{space 6}other  {c |}{col 14}{res}{space 2}  .064563{col 26}{space 2}  .008817{col 37}{space 1}    7.32{col 46}{space 3}0.000{col 54}{space 4} .0472816{col 67}{space 3} .0818444
{txt}{space 12} {c |}
income_group {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.0082847{col 26}{space 2} .0049636{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-.0180134{col 67}{space 3}  .001444
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0067437{col 26}{space 2} .0049739{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-.0164925{col 67}{space 3} .0030051
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2701971{col 26}{space 2} .0037985{col 37}{space 1}   71.13{col 46}{space 3}0.000{col 54}{space 4} .2627521{col 67}{space 3} .2776422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_18
. clear all
{res}{txt}
{com}. //_19
. set obs 100 // 100 observations
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. //_20
. generate z = runiform(-5, 5) // randomly distributed z scores
{txt}
{com}. //_21
. generate mynormaldensities = normalden(z) // normal densities
{txt}
{com}. //_22
. generate myprobabilities = normal(z) // cumulative normal probabilities
{txt}
{com}. //_23
. twoway scatter mynormaldensities myprobabilities z, scheme(michigan)
{res}{txt}
{com}. //_24
. graph export normal.png, width(500) replace
{txt}(file normal.png written in PNG format)

{com}. //_25
. use GSSsmall.dta, clear
{txt}
{com}. //_26
. probit liberal i.race i.latinx i.class i.income_group

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-28929.993}  
Iteration 1:{space 3}log likelihood = {res:-28779.708}  
Iteration 2:{space 3}log likelihood = {res:-28779.659}  
Iteration 3:{space 3}log likelihood = {res:-28779.659}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}    48,767
{txt}{col 49}LR chi2({res}8{txt}){col 67}= {res}    300.67
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-28779.659{txt}{col 49}Pseudo R2{col 67}= {res}    0.0052

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       liberal{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      z{col 48}   P>|z|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}race {c |}
{space 8}black  {c |}{col 16}{res}{space 2} .2556235{col 28}{space 2} .0176569{col 39}{space 1}   14.48{col 48}{space 3}0.000{col 56}{space 4} .2210165{col 69}{space 3} .2902305
{txt}{space 8}other  {c |}{col 16}{res}{space 2} .1917797{col 28}{space 2} .0263808{col 39}{space 1}    7.27{col 48}{space 3}0.000{col 56}{space 4} .1400744{col 69}{space 3} .2434851
{txt}{space 14} {c |}
{space 6}1.latinx {c |}{col 16}{res}{space 2}-.0105591{col 28}{space 2} .0128091{col 39}{space 1}   -0.82{col 48}{space 3}0.410{col 56}{space 4}-.0356644{col 69}{space 3} .0145462
{txt}{space 14} {c |}
{space 9}class {c |}
working class  {c |}{col 16}{res}{space 2}-.0533243{col 28}{space 2} .0268567{col 39}{space 1}   -1.99{col 48}{space 3}0.047{col 56}{space 4}-.1059624{col 69}{space 3}-.0006861
{txt}{space 1}middle class  {c |}{col 16}{res}{space 2} .0364691{col 28}{space 2} .0275156{col 39}{space 1}    1.33{col 48}{space 3}0.185{col 56}{space 4}-.0174605{col 69}{space 3} .0903987
{txt}{space 2}upper class  {c |}{col 16}{res}{space 2} .1287644{col 28}{space 2} .0426698{col 39}{space 1}    3.02{col 48}{space 3}0.003{col 56}{space 4} .0451331{col 69}{space 3} .2123957
{txt}{space 14} {c |}
{space 2}income_group {c |}
{space 12}1  {c |}{col 16}{res}{space 2}-.0277126{col 28}{space 2} .0153164{col 39}{space 1}   -1.81{col 48}{space 3}0.070{col 56}{space 4}-.0577322{col 69}{space 3}  .002307
{txt}{space 12}2  {c |}{col 16}{res}{space 2}-.0430226{col 28}{space 2} .0159505{col 39}{space 1}   -2.70{col 48}{space 3}0.007{col 56}{space 4} -.074285{col 69}{space 3}-.0117602
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} -.597907{col 28}{space 2} .0258768{col 39}{space 1}  -23.11{col 48}{space 3}0.000{col 56}{space 4}-.6486245{col 69}{space 3}-.5471894
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_27
. clear all
{res}{txt}
{com}. //_28
. set obs 100 // 100 observations
{txt}{p}
number of observations (_N)  was 0,
now 100
{p_end}

{com}. //_29
. generate z = runiform(-5, 5) // randomly distributed z scores
{txt}
{com}. //_30
. generate mylogisticdensities = logisticden(z) // logistic densities
{txt}
{com}. //_31
. generate mylogisticprobabilities = logistic(z) // cumulative logistic probabilities
{txt}
{com}. //_32
. twoway scatter mylogisticdensities mylogisticprobabilities z, scheme(michigan)
{res}{txt}
{com}. //_33
. graph export logistic.png, width(500) replace
{txt}(file logistic.png written in PNG format)

{com}. //_34
. use GSSsmall.dta, clear
{txt}
{com}. //_35
. logit liberal i.race i.latinx i.class i.income_group

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-28929.993}  
Iteration 1:{space 3}log likelihood = {res:-28780.507}  
Iteration 2:{space 3}log likelihood = {res:-28779.998}  
Iteration 3:{space 3}log likelihood = {res:-28779.998}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    48,767
{txt}{col 49}LR chi2({res}8{txt}){col 67}= {res}    299.99
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-28779.998{txt}{col 49}Pseudo R2{col 67}= {res}    0.0052

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       liberal{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      z{col 48}   P>|z|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}race {c |}
{space 8}black  {c |}{col 16}{res}{space 2} .4224471{col 28}{space 2} .0289399{col 39}{space 1}   14.60{col 48}{space 3}0.000{col 56}{space 4} .3657258{col 69}{space 3} .4791683
{txt}{space 8}other  {c |}{col 16}{res}{space 2} .3178327{col 28}{space 2} .0433273{col 39}{space 1}    7.34{col 48}{space 3}0.000{col 56}{space 4} .2329127{col 69}{space 3} .4027526
{txt}{space 14} {c |}
{space 6}1.latinx {c |}{col 16}{res}{space 2} -.018475{col 28}{space 2} .0214155{col 39}{space 1}   -0.86{col 48}{space 3}0.388{col 56}{space 4}-.0604486{col 69}{space 3} .0234985
{txt}{space 14} {c |}
{space 9}class {c |}
working class  {c |}{col 16}{res}{space 2}-.0889014{col 28}{space 2} .0446312{col 39}{space 1}   -1.99{col 48}{space 3}0.046{col 56}{space 4} -.176377{col 69}{space 3}-.0014258
{txt}{space 1}middle class  {c |}{col 16}{res}{space 2} .0599663{col 28}{space 2} .0456742{col 39}{space 1}    1.31{col 48}{space 3}0.189{col 56}{space 4}-.0295536{col 69}{space 3} .1494862
{txt}{space 2}upper class  {c |}{col 16}{res}{space 2} .2126988{col 28}{space 2} .0704279{col 39}{space 1}    3.02{col 48}{space 3}0.003{col 56}{space 4} .0746626{col 69}{space 3} .3507349
{txt}{space 14} {c |}
{space 2}income_group {c |}
{space 12}1  {c |}{col 16}{res}{space 2}-.0454226{col 28}{space 2} .0255762{col 39}{space 1}   -1.78{col 48}{space 3}0.076{col 56}{space 4} -.095551{col 69}{space 3} .0047057
{txt}{space 12}2  {c |}{col 16}{res}{space 2}-.0697336{col 28}{space 2} .0266137{col 39}{space 1}   -2.62{col 48}{space 3}0.009{col 56}{space 4}-.1218954{col 69}{space 3}-.0175718
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2}-.9703756{col 28}{space 2} .0430156{col 39}{space 1}  -22.56{col 48}{space 3}0.000{col 56}{space 4}-1.054685{col 69}{space 3}-.8860666
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_36
. quietly probit liberal i.race i.latinx i.class i.income_group
{txt}
{com}. //_37
. est store myprobit
{txt}
{com}. //_38
. quietly logit liberal i.race i.latinx i.class i.income_group
{txt}
{com}. //_39
. est store mylogit
{txt}
{com}. //_40
. est table myprobit mylogit, star
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 12:Variable} {c |} {center 13:myprobit} {space 1} {center 13:mylogit} {space 1}
{hline 12}{c -}{c +}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{res}{txt}{space 8}race {c |}
{space 6}black  {c |}{res} {ralign 10:.25562351}{lalign 3:***}{txt} {space 1}{res} {ralign 10:.42244708}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 6}other  {c |}{res} {ralign 10:.19177974}{lalign 3:***}{txt} {space 1}{res} {ralign 10:.31783265}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 6}latinx {c |}
{space 10}1  {c |}{res} {ralign 10:-.0105591}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.01847504}{lalign 3:}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 7}class {c |}
working c..  {c |}{res} {ralign 10:-.05332425}{lalign 3:*}{txt} {space 1}{res} {ralign 10:-.08890139}{lalign 3:*}{txt} {space 1}
{res}{txt}middle cl..  {c |}{res} {ralign 10:.03646909}{lalign 3:}{txt} {space 1}{res} {ralign 10:.05996631}{lalign 3:}{txt} {space 1}
{res}{txt}upper class  {c |}{res} {ralign 10:.12876439}{lalign 3:**}{txt} {space 1}{res} {ralign 10:.21269875}{lalign 3:**}{txt} {space 1}
{res}{txt}{space 12} {c |}
income_group {c |}
{space 10}1  {c |}{res} {ralign 10:-.02771262}{lalign 3:}{txt} {space 1}{res} {ralign 10:-.04542261}{lalign 3:}{txt} {space 1}
{res}{txt}{space 10}2  {c |}{res} {ralign 10:-.04302264}{lalign 3:**}{txt} {space 1}{res} {ralign 10:-.06973358}{lalign 3:**}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 7}_cons {c |}{res} {ralign 10:-.59790698}{lalign 3:***}{txt} {space 1}{res} {ralign 10:-.9703756}{lalign 3:***}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 13}{c -}{c -}{c -}{hline 13}{c -}{c -}
{ralign 46:legend: * p<0.05; ** p<0.01; *** p<0.001}
{res}{txt}
{com}. //_41
. logit liberal i.race i.latinx i.class i.income_group, or

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-28929.993}  
Iteration 1:{space 3}log likelihood = {res:-28780.507}  
Iteration 2:{space 3}log likelihood = {res:-28779.998}  
Iteration 3:{space 3}log likelihood = {res:-28779.998}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    48,767
{txt}{col 49}LR chi2({res}8{txt}){col 67}= {res}    299.99
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-28779.998{txt}{col 49}Pseudo R2{col 67}= {res}    0.0052

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       liberal{col 16}{c |} Odds Ratio{col 28}   Std. Err.{col 40}      z{col 48}   P>|z|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}race {c |}
{space 8}black  {c |}{col 16}{res}{space 2}  1.52569{col 28}{space 2} .0441534{col 39}{space 1}   14.60{col 48}{space 3}0.000{col 56}{space 4}  1.44156{col 69}{space 3} 1.614731
{txt}{space 8}other  {c |}{col 16}{res}{space 2} 1.374146{col 28}{space 2}  .059538{col 39}{space 1}    7.34{col 48}{space 3}0.000{col 56}{space 4} 1.262271{col 69}{space 3} 1.495937
{txt}{space 14} {c |}
{space 6}1.latinx {c |}{col 16}{res}{space 2} .9816946{col 28}{space 2} .0210234{col 39}{space 1}   -0.86{col 48}{space 3}0.388{col 56}{space 4} .9413422{col 69}{space 3} 1.023777
{txt}{space 14} {c |}
{space 9}class {c |}
working class  {c |}{col 16}{res}{space 2} .9149358{col 28}{space 2} .0408347{col 39}{space 1}   -1.99{col 48}{space 3}0.046{col 56}{space 4} .8383019{col 69}{space 3} .9985752
{txt}{space 1}middle class  {c |}{col 16}{res}{space 2} 1.061801{col 28}{space 2}  .048497{col 39}{space 1}    1.31{col 48}{space 3}0.189{col 56}{space 4} .9708789{col 69}{space 3} 1.161237
{txt}{space 2}upper class  {c |}{col 16}{res}{space 2} 1.237012{col 28}{space 2} .0871201{col 39}{space 1}    3.02{col 48}{space 3}0.003{col 56}{space 4} 1.077521{col 69}{space 3} 1.420111
{txt}{space 14} {c |}
{space 2}income_group {c |}
{space 12}1  {c |}{col 16}{res}{space 2} .9555936{col 28}{space 2} .0244404{col 39}{space 1}   -1.78{col 48}{space 3}0.076{col 56}{space 4}  .908872{col 69}{space 3} 1.004717
{txt}{space 12}2  {c |}{col 16}{res}{space 2} .9326423{col 28}{space 2}  .024821{col 39}{space 1}   -2.62{col 48}{space 3}0.009{col 56}{space 4}  .885241{col 69}{space 3} .9825817
{txt}{space 14} {c |}
{space 9}_cons {c |}{col 16}{res}{space 2} .3789407{col 28}{space 2} .0163004{col 39}{space 1}  -22.56{col 48}{space 3}0.000{col 56}{space 4} .3483023{col 69}{space 3} .4122742
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: {res:_cons} estimates baseline odds{txt}.{p_end}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-regression/logistic-regression.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Jul 2020, 17:43:14
{txt}{.-}
{smcl}
{txt}{sf}{ul off}