{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-and-covariates/logistic-and-covariates.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Sep 2020, 09:58:09
{txt}
{com}. //_1
. display c(current_date)
{res} 9 Sep 2020
{txt}
{com}. //_2
. display c(current_time)
{res}09:58:09
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. cd "/Users/agrogan/Desktop/newstuff/categorical/logistic-and-covariates"
{res}/Users/agrogan/Desktop/newstuff/categorical/logistic-and-covariates
{txt}
{com}. //_5
. set obs 10000
{txt}{p}
number of observations (_N)  was 0,
now 10,000
{p_end}

{com}. //_6
. set seed 3846 // random seed
{txt}
{com}. //_7
. generate x1 = rnormal() // normally distributed x
{txt}
{com}. //_8
. histogram x1, scheme(michigan)
{txt}(bin={res}40{txt}, start={res}-3.7857256{txt}, width={res}.19587822{txt})
{res}{txt}
{com}. //_9
. graph export histogram1.png, width(500) replace
{txt}(file histogram1.png written in PNG format)

{com}. //_10
. generate x2 = rnormal() // normally distributed z
{txt}
{com}. //_11
. histogram x2, scheme(michigan)
{txt}(bin={res}40{txt}, start={res}-3.9428685{txt}, width={res}.19152238{txt})
{res}{txt}
{com}. //_12
. graph export histogram2.png, width(500) replace
{txt}(file histogram2.png written in PNG format)

{com}. //_13
. generate e = rnormal(0, .5) // normally distributed error
{txt}
{com}. //_14
. corr x1 x2 // x1 and x2 are uncorrelated
{txt}(obs=10,000)

             {c |}       x1       x2
{hline 13}{c +}{hline 18}
          x1 {c |}{res}   1.0000
          {txt}x2 {c |}{res}   0.0150   1.0000

{txt}
{com}. //_15
. generate y1 = x1 + x2 + e // dependent variable
{txt}
{com}. //_16
. regress y1 x1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,000
{txt}{hline 13}{c +}{hline 34}   F(1, 9998)      = {res}  8571.07
{txt}       Model {c |} {res}  10888.525         1   10888.525   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 12701.2625     9,998  1.27038033   {txt}R-squared       ={res}    0.4616
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4615
{txt}       Total {c |} {res} 23589.7876     9,999  2.35921468   {txt}Root MSE        =   {res} 1.1271

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} 1.024698{col 26}{space 2} .0110682{col 37}{space 1}   92.58{col 46}{space 3}0.000{col 54}{space 4} 1.003002{col 67}{space 3} 1.046394
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0013059{col 26}{space 2} .0112712{col 37}{space 1}    0.12{col 46}{space 3}0.908{col 54}{space 4} -.020788{col 67}{space 3} .0233997
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_17
. est store OLS1 // store estimates
{txt}
{com}. //_18
. regress y1 x1 x2 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    10,000
{txt}{hline 13}{c +}{hline 34}   F(2, 9997)      = {res} 41868.07
{txt}       Model {c |} {res} 21073.8459         2  10536.9229   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2515.94171     9,997  .251669672   {txt}R-squared       ={res}    0.8933
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8933
{txt}       Total {c |} {res} 23589.7876     9,999  2.35921468   {txt}Root MSE        =   {res} .50167

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} 1.009826{col 26}{space 2} .0049269{col 37}{space 1}  204.96{col 46}{space 3}0.000{col 54}{space 4} 1.000169{col 67}{space 3} 1.019484
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} 1.006154{col 26}{space 2} .0050014{col 37}{space 1}  201.17{col 46}{space 3}0.000{col 54}{space 4} .9963505{col 67}{space 3} 1.015958
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0015213{col 26}{space 2} .0050167{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-.0083125{col 67}{space 3}  .011355
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_19
. est store OLS2 // store estimates
{txt}
{com}. //_20
. estimates table OLS1 OLS2, b(%7.4f) star // table comparing estimates
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:OLS1} {space 1} {center 10:OLS2} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}x1 {c |}{res} {ralign 7:1.0247}{lalign 3:***}{txt} {space 1}{res} {ralign 7:1.0098}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 10}x2 {c |}{res} {ralign 7:}{lalign 3:}{txt} {space 1}{res} {ralign 7:1.0062}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 7:0.0013}{lalign 3:}{txt} {space 1}{res} {ralign 7:0.0015}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 40:legend: * p<0.05; ** p<0.01; *** p<0.001}
{res}{txt}
{com}. //_21
. generate prob_y2 = exp(x1 + x2 + e) / (1 + exp(x1 + x2 + e)) // dependent variable 
{txt}
{com}. //_22
. recode prob_y2 (0/.5 =0)(.5/1 = 1), generate(y2) // recode probabilites as observed values
{txt}(10000 differences between prob_y2 and y2)

{com}. //_23
. logit y2 x1

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6931.3566}  
Iteration 1:{space 3}log likelihood = {res:-5193.5531}  
Iteration 2:{space 3}log likelihood = {res:-5191.3673}  
Iteration 3:{space 3}log likelihood = {res:-5191.3654}  
Iteration 4:{space 3}log likelihood = {res:-5191.3654}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}1{txt}){col 67}= {res}   3479.98
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-5191.3654{txt}{col 49}Pseudo R2{col 67}= {res}    0.2510

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} 1.529607{col 26}{space 2} .0329772{col 37}{space 1}   46.38{col 46}{space 3}0.000{col 54}{space 4} 1.464973{col 67}{space 3} 1.594241
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0205374{col 26}{space 2} .0240145{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-.0265302{col 67}{space 3}  .067605
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_24
. est store logit1
{txt}
{com}. //_25
. logit y2 x1 x2

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-6931.3566}  
Iteration 1:{space 3}log likelihood = {res:-2326.0511}  
Iteration 2:{space 3}log likelihood = {res:-2285.4234}  
Iteration 3:{space 3}log likelihood = {res:-2285.2877}  
Iteration 4:{space 3}log likelihood = {res:-2285.2877}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}    10,000
{txt}{col 49}LR chi2({res}2{txt}){col 67}= {res}   9292.14
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-2285.2877{txt}{col 49}Pseudo R2{col 67}= {res}    0.6703

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          y2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x1 {c |}{col 14}{res}{space 2} 3.694725{col 26}{space 2} .0867616{col 37}{space 1}   42.58{col 46}{space 3}0.000{col 54}{space 4} 3.524675{col 67}{space 3} 3.864774
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} 3.716715{col 26}{space 2} .0876762{col 37}{space 1}   42.39{col 46}{space 3}0.000{col 54}{space 4} 3.544873{col 67}{space 3} 3.888557
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0369852{col 26}{space 2} .0375883{col 37}{space 1}    0.98{col 46}{space 3}0.325{col 54}{space 4}-.0366864{col 67}{space 3} .1106569
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 6 2}Note: 6 failures and 4 successes completely determined.{p_end}

{com}. //_26
. est store logit2
{txt}
{com}. //_27
. estimates table logit1 logit2, b(%7.4f) star // table comparing estimates
{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:logit1} {space 1} {center 10:logit2} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}x1 {c |}{res} {ralign 7:1.5296}{lalign 3:***}{txt} {space 1}{res} {ralign 7:3.6947}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 10}x2 {c |}{res} {ralign 7:}{lalign 3:}{txt} {space 1}{res} {ralign 7:3.7167}{lalign 3:***}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 7:0.0205}{lalign 3:}{txt} {space 1}{res} {ralign 7:0.0370}{lalign 3:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 40:legend: * p<0.05; ** p<0.01; *** p<0.001}
{res}{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-and-covariates/logistic-and-covariates.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Sep 2020, 09:58:12
{txt}{.-}
{smcl}
{txt}{sf}{ul off}