{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-interactions-2/logistic-interactions-2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Jul 2020, 13:28:29
{txt}
{com}. //_1
. display c(current_date)
{res} 7 Jul 2020
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. //_3
. graph close _all
{txt}
{com}. //_4
. use http://www.stata-press.com/data/r15/margex, clear
{txt}(Artificial data for margins)

{com}. //_5
. describe

{txt}Contains data from {res}http://www.stata-press.com/data/r15/margex.dta
{txt}  obs:{res}         3,000                          Artificial data for margins
{txt} vars:{res}            11                          27 Nov 2016 14:27
{txt} size:{res}        78,000                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:y              }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:outcome        }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:{txt}%6.0f     }{space 1}{bind:sexlbl   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:group          }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age            }{txt}{bind: float   }{bind:{txt}%3.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:distance       }{txt}{bind: float   }{bind:{txt}%6.2f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:ycn            }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:yc             }{txt}{bind: float   }{bind:{txt}%6.1f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:treatment      }{txt}{bind: byte    }{bind:{txt}%2.0f     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:agegroup       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:agelab   }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:arm            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: {res}group
{txt}
{com}. //_6
. logit outcome sex##c.age group

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-1366.0718}  
Iteration 1:{space 3}log likelihood = {res:-1117.9739}  
Iteration 2:{space 3}log likelihood = {res:-1070.4331}  
Iteration 3:{space 3}log likelihood = {res:-1068.1463}  
Iteration 4:{space 3}log likelihood = {res:-1068.1394}  
Iteration 5:{space 3}log likelihood = {res:-1068.1394}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     3,000
{txt}{col 49}LR chi2({res}4{txt}){col 67}= {res}    595.86
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-1068.1394{txt}{col 49}Pseudo R2{col 67}= {res}    0.2181

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}sex {c |}
{space 5}female  {c |}{col 14}{res}{space 2} .6128018{col 26}{space 2} .6410998{col 37}{space 1}    0.96{col 46}{space 3}0.339{col 54}{space 4}-.6437307{col 67}{space 3} 1.869334
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0919461{col 26}{space 2}  .011215{col 37}{space 1}    8.20{col 46}{space 3}0.000{col 54}{space 4} .0699652{col 67}{space 3} .1139271
{txt}{space 12} {c |}
{space 3}sex#c.age {c |}
{space 5}female  {c |}{col 14}{res}{space 2}-.0023741{col 26}{space 2} .0132292{col 37}{space 1}   -0.18{col 46}{space 3}0.858{col 54}{space 4}-.0283028{col 67}{space 3} .0235547
{txt}{space 12} {c |}
{space 7}group {c |}{col 14}{res}{space 2}-.6267288{col 26}{space 2} .1119308{col 37}{space 1}   -5.60{col 46}{space 3}0.000{col 54}{space 4}-.8461092{col 67}{space 3}-.4073484
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.000151{col 26}{space 2} .6104382{col 37}{space 1}   -8.19{col 46}{space 3}0.000{col 54}{space 4}-6.196588{col 67}{space 3}-3.803714
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_7
. margins sex, at(age = (20 30 40 50 60))
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     3,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(outcome), predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}30}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}40}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}50}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#sex {c |}
{space 5}1#male  {c |}{col 14}{res}{space 2} .0147659{col 26}{space 2} .0046146{col 37}{space 1}    3.20{col 46}{space 3}0.001{col 54}{space 4} .0057214{col 67}{space 3} .0238104
{txt}{space 3}1#female  {c |}{col 14}{res}{space 2} .0256473{col 26}{space 2} .0055867{col 37}{space 1}    4.59{col 46}{space 3}0.000{col 54}{space 4} .0146975{col 67}{space 3} .0365971
{txt}{space 5}2#male  {c |}{col 14}{res}{space 2}  .036082{col 26}{space 2} .0074358{col 37}{space 1}    4.85{col 46}{space 3}0.000{col 54}{space 4} .0215081{col 67}{space 3} .0506559
{txt}{space 3}2#female  {c |}{col 14}{res}{space 2} .0601807{col 26}{space 2} .0086289{col 37}{space 1}    6.97{col 46}{space 3}0.000{col 54}{space 4} .0432683{col 67}{space 3}  .077093
{txt}{space 5}3#male  {c |}{col 14}{res}{space 2} .0850702{col 26}{space 2}  .009884{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4} .0656979{col 67}{space 3} .1044425
{txt}{space 3}3#female  {c |}{col 14}{res}{space 2} .1338511{col 26}{space 2} .0108109{col 37}{space 1}   12.38{col 46}{space 3}0.000{col 54}{space 4} .1126622{col 67}{space 3} .1550401
{txt}{space 5}4#male  {c |}{col 14}{res}{space 2} .1859699{col 26}{space 2} .0163525{col 37}{space 1}   11.37{col 46}{space 3}0.000{col 54}{space 4} .1539195{col 67}{space 3} .2180202
{txt}{space 3}4#female  {c |}{col 14}{res}{space 2}   .26897{col 26}{space 2} .0156965{col 37}{space 1}   17.14{col 46}{space 3}0.000{col 54}{space 4} .2382054{col 67}{space 3} .2997346
{txt}{space 5}5#male  {c |}{col 14}{res}{space 2} .3558393{col 26}{space 2} .0405971{col 37}{space 1}    8.77{col 46}{space 3}0.000{col 54}{space 4} .2762704{col 67}{space 3} .4354082
{txt}{space 3}5#female  {c |}{col 14}{res}{space 2} .4632205{col 26}{space 2} .0316107{col 37}{space 1}   14.65{col 46}{space 3}0.000{col 54}{space 4} .4012647{col 67}{space 3} .5251762
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_8
. marginsplot, ///
> scheme(michigan) /// michigan graph scheme
> plotopts(msize(vlarge)) /// larger plotting symbols
> plot1opts(lcolor(navy)) /// line for first group is navy
> plot2opts(lcolor(gold)) // line for second group is gold
{res}
{text}{p 2 6 2}Variables that uniquely identify margins: age sex{p_end}
{res}{txt}
{com}. //_9
. graph export mymarginsplot.png, width(500) replace
{txt}(file mymarginsplot.png written in PNG format)

{com}. //_10
. margins sex, at(age = (20 30 40 50 60)) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     3,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(outcome), predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}30}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}40}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}50}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#sex {c |}
{space 5}1#male  {c |}{col 14}{res}{space 2} .0147659{col 26}{space 2} .0046146{col 37}{space 1}    3.20{col 46}{space 3}0.001{col 54}{space 4} .0057214{col 67}{space 3} .0238104
{txt}{space 3}1#female  {c |}{col 14}{res}{space 2} .0256473{col 26}{space 2} .0055867{col 37}{space 1}    4.59{col 46}{space 3}0.000{col 54}{space 4} .0146975{col 67}{space 3} .0365971
{txt}{space 5}2#male  {c |}{col 14}{res}{space 2}  .036082{col 26}{space 2} .0074358{col 37}{space 1}    4.85{col 46}{space 3}0.000{col 54}{space 4} .0215081{col 67}{space 3} .0506559
{txt}{space 3}2#female  {c |}{col 14}{res}{space 2} .0601807{col 26}{space 2} .0086289{col 37}{space 1}    6.97{col 46}{space 3}0.000{col 54}{space 4} .0432683{col 67}{space 3}  .077093
{txt}{space 5}3#male  {c |}{col 14}{res}{space 2} .0850702{col 26}{space 2}  .009884{col 37}{space 1}    8.61{col 46}{space 3}0.000{col 54}{space 4} .0656979{col 67}{space 3} .1044425
{txt}{space 3}3#female  {c |}{col 14}{res}{space 2} .1338511{col 26}{space 2} .0108109{col 37}{space 1}   12.38{col 46}{space 3}0.000{col 54}{space 4} .1126622{col 67}{space 3} .1550401
{txt}{space 5}4#male  {c |}{col 14}{res}{space 2} .1859699{col 26}{space 2} .0163525{col 37}{space 1}   11.37{col 46}{space 3}0.000{col 54}{space 4} .1539195{col 67}{space 3} .2180202
{txt}{space 3}4#female  {c |}{col 14}{res}{space 2}   .26897{col 26}{space 2} .0156965{col 37}{space 1}   17.14{col 46}{space 3}0.000{col 54}{space 4} .2382054{col 67}{space 3} .2997346
{txt}{space 5}5#male  {c |}{col 14}{res}{space 2} .3558393{col 26}{space 2} .0405971{col 37}{space 1}    8.77{col 46}{space 3}0.000{col 54}{space 4} .2762704{col 67}{space 3} .4354082
{txt}{space 3}5#female  {c |}{col 14}{res}{space 2} .4632205{col 26}{space 2} .0316107{col 37}{space 1}   14.65{col 46}{space 3}0.000{col 54}{space 4} .4012647{col 67}{space 3} .5251762
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_11
. margins, coeflegend

{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     3,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(outcome), predict()}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:1._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}20}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:2._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}30}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:3._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}40}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:4._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}50}{p_end}
{p2colreset}{...}

{txt}{p2colset 1 14 16 2}{...}
{p2col:5._at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}     Margin{col 26}  Legend
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}_at#sex {c |}
{space 5}1#male  {c |}{col 14}{res}{space 2} .0147659{col 26}{txt}  _b[1bn._at#0bn.sex]
{space 3}1#female  {c |}{col 14}{res}{space 2} .0256473{col 26}{txt}  _b[1bn._at#1.sex]
{space 5}2#male  {c |}{col 14}{res}{space 2}  .036082{col 26}{txt}  _b[2._at#0bn.sex]
{space 3}2#female  {c |}{col 14}{res}{space 2} .0601807{col 26}{txt}  _b[2._at#1.sex]
{space 5}3#male  {c |}{col 14}{res}{space 2} .0850702{col 26}{txt}  _b[3._at#0bn.sex]
{space 3}3#female  {c |}{col 14}{res}{space 2} .1338511{col 26}{txt}  _b[3._at#1.sex]
{space 5}4#male  {c |}{col 14}{res}{space 2} .1859699{col 26}{txt}  _b[4._at#0bn.sex]
{space 3}4#female  {c |}{col 14}{res}{space 2}   .26897{col 26}{txt}  _b[4._at#1.sex]
{space 5}5#male  {c |}{col 14}{res}{space 2} .3558393{col 26}{txt}  _b[5._at#0bn.sex]
{space 3}5#female  {c |}{col 14}{res}{space 2} .4632205{col 26}{txt}  _b[5._at#1.sex]
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. //_12
. test _b[1bn._at#0bn.sex] = _b[1bn._at#1.sex] // male and female at age 20

{p 0 7}{space 1}{text:( 1)}{space 1} {res}1bn._at#0bn.sex - 1bn._at#1.sex = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    2.29
{txt}{col 10}Prob > chi2 =  {res}  0.1303
{txt}
{com}. //_13
. test  _b[5._at#0bn.sex] =  _b[5._at#1.sex] // male and female at age 60

{p 0 7}{space 1}{text:( 1)}{space 1} {res}5._at#0bn.sex - 5._at#1.sex = 0{p_end}

{txt}{col 12}chi2(  1) ={res}    4.91
{txt}{col 10}Prob > chi2 =  {res}  0.0267
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/logistic-interactions-2/logistic-interactions-2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Jul 2020, 13:28:32
{txt}{.-}
{smcl}
{txt}{sf}{ul off}