{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/MICS-eliminate-cp/MICS-eliminate-cp.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}10 Sep 2020, 16:56:39
{txt}
{com}. //_1
. display c(current_date)
{res}10 Sep 2020
{txt}
{com}. //_2
. display c(current_time)
{res}16:56:39
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}.     
. set seed 3846
{txt}
{com}.     
. cd "/Users/agrogan/Desktop/newstuff/MICS-eliminate-cp"
{res}/Users/agrogan/Desktop/newstuff/MICS-eliminate-cp
{txt}
{com}. 
. use "/Users/agrogan/Box Sync/MICS/Data/MICS.dta"
{txt}
{com}. //_4
. tabulate d_phys_spank 

   {txt}Selected {c |}
      child {c |}
    spanked {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}    122,373       56.68       56.68
{txt}          1 {c |}{res}     93,512       43.32      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    215,885      100.00
{txt}
{com}. //_5
. melogit ec16 i.d_phys_spank cmale cage || country:    
{res}{txt}
Fitting fixed-effects model:

Iteration 0:{space 3}log likelihood = {res:-142628.21}  
Iteration 1:{space 3}log likelihood = {res:-142431.02}  
Iteration 2:{space 3}log likelihood = {res:-142430.93}  
Iteration 3:{space 3}log likelihood = {res:-142430.93}  

Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-135384.24}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-135384.24}  (not concave)
Iteration 1:{space 3}log likelihood = {res:-135381.58}  (backed up)
Iteration 2:{space 3}log likelihood = {res:   -135380}  (backed up)
Iteration 3:{space 3}log likelihood = {res:-135376.47}  
Iteration 4:{space 3}log likelihood = {res:-135368.83}  
Iteration 5:{space 3}log likelihood = {res:-135359.89}  
Iteration 6:{space 3}log likelihood = {res:-135351.72}  
Iteration 7:{space 3}log likelihood = {res:-135349.08}  
Iteration 8:{space 3}log likelihood = {res:-135349.08}  
{res}
{txt}Mixed-effects logistic regression{col 49}{txt}Number of obs{col 67}={res}{col 69}   215,885
{txt}Group variable: {col 25}{res}country{col 49}{txt}Number of groups{col 67}={res}{col 69}        62

{col 49}{txt}Obs per group:
{col 63}{txt}min{col 67}={res}{col 69}       115
{col 63}{txt}avg{col 67}={res}{col 69}   3,482.0
{col 63}{txt}max{col 67}={res}{col 69}    20,451

{txt}Integration method: {col 21}{res}mvaghermite{col 49}{txt}Integration pts.{col 67}={col 78}{res}7

{col 49}{txt}Wald chi2({res}3{txt}){col 67}={res}{col 70}  2481.66
{txt}Log likelihood = {res}-135349.08{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000
{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          ec16{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      z{col 48}   P>|z|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14} {c |}
1.d_phys_spank {c |}{col 16}{res}{space 2} .3466554{col 28}{space 2} .0094956{col 39}{space 1}   36.51{col 48}{space 3}0.000{col 56}{space 4} .3280443{col 69}{space 3} .3652665
{txt}{space 9}cmale {c |}{col 16}{res}{space 2} .3010048{col 28}{space 2} .0092288{col 39}{space 1}   32.62{col 48}{space 3}0.000{col 56}{space 4} .2829166{col 69}{space 3} .3190929
{txt}{space 10}cage {c |}{col 16}{res}{space 2}-.0060204{col 28}{space 2}  .000674{col 39}{space 1}   -8.93{col 48}{space 3}0.000{col 56}{space 4}-.0073415{col 69}{space 3}-.0046993
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-.6711418{col 28}{space 2} .0895672{col 39}{space 1}   -7.49{col 48}{space 3}0.000{col 56}{space 4}-.8466903{col 69}{space 3}-.4955932
{txt}{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}country       {col 16}{txt}{c |}
     var(_cons){c |}{col 16}{res}{space 2} .4282121{col 28}{space 2} .0778397{col 56}{space 4} .2998671{col 69}{space 3} .6114895
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test vs. logistic model: {txt}{help j_chibar##|_new:chibar2(01) =}{res} 14163.72{col 55}{txt}Prob >= chibar2 = {res}{col 73}0.0000
{txt}
{com}. //_6
. margins d_phys_spank // predicted probabilities of aggression    
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}   215,885
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Marginal predicted mean, predict()}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
d_phys_spank {c |}
{space 10}0  {c |}{col 14}{res}{space 2} .3251464{col 26}{space 2} .0169289{col 37}{space 1}   19.21{col 46}{space 3}0.000{col 54}{space 4} .2919665{col 67}{space 3} .3583264
{txt}{space 10}1  {c |}{col 14}{res}{space 2} .3979304{col 26}{space 2} .0182745{col 37}{space 1}   21.78{col 46}{space 3}0.000{col 54}{space 4} .3621131{col 67}{space 3} .4337478
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_7
. * matrix b = r(b) // get matrix of results
.     
. * matrix list b  // list it out to double check    
. //_8
. display round(.5668 * .3251464  * 100)
{res}18
{txt}
{com}. //_9
. display 57 - 18
{res}39
{txt}
{com}. //_10
. display round(.4332 * .3979304 * 100)
{res}17
{txt}
{com}. //_11
. display 43 - 17
{res}26
{txt}
{com}. //_12
. display round(.4332 * .3251464  * 100)    
{res}14
{txt}
{com}. //_13
. display 17 - 14 // this many fewer aggressive children / 100
{res}3
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/MICS-eliminate-cp/MICS-eliminate-cp.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}10 Sep 2020, 16:58:56
{txt}{.-}
{smcl}
{txt}{sf}{ul off}