{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/contingency-tables/simpsons-paradox-hospital-data/simpsons-paradox-hospital-data.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}18 Sep 2020, 08:46:40
{txt}
{com}. //_1
. display c(current_date)
{res}18 Sep 2020
{txt}
{com}. //_2
. display c(current_time)
{res}08:46:40
{txt}
{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. cd "/Users/agrogan/Desktop/newstuff/categorical/contingency-tables/simpsons-paradox-hospital-data"
{res}/Users/agrogan/Desktop/newstuff/categorical/contingency-tables/simpsons-paradox-hospital-data
{txt}
{com}. //_5
. use "hospitaldata.dta"
{txt}
{com}. //_6
. list
{txt}
     {c TLC}{hline 10}{c -}{hline 13}{c -}{hline 9}{c -}{hline 7}{c TRC}
     {c |} {res}hospital      severity   outcome   count {txt}{c |}
     {c LT}{hline 10}{c -}{hline 13}{c -}{hline 9}{c -}{hline 7}{c RT}
  1. {c |} {res}  better   less severe   success      18 {txt}{c |}
  2. {c |} {res}  better   less severe   failure       2 {txt}{c |}
  3. {c |} {res}  better   more severe   success      32 {txt}{c |}
  4. {c |} {res}  better   more severe   failure      48 {txt}{c |}
  5. {c |} {res}  normal   less severe   success      64 {txt}{c |}
     {c LT}{hline 10}{c -}{hline 13}{c -}{hline 9}{c -}{hline 7}{c RT}
  6. {c |} {res}  normal   less severe   failure      16 {txt}{c |}
  7. {c |} {res}  normal   more severe   success       4 {txt}{c |}
  8. {c |} {res}  normal   more severe   failure      16 {txt}{c |}
     {c BLC}{hline 10}{c -}{hline 13}{c -}{hline 9}{c -}{hline 7}{c BRC}

{com}. //_7
. tabulate hospital outcome

           {txt}{c |}        outcome
  hospital {c |}   failure    success {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    better {c |}{res}         2          2 {txt}{c |}{res}         4 
{txt}    normal {c |}{res}         2          2 {txt}{c |}{res}         4 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}         4          4 {txt}{c |}{res}         8 
{txt}
{com}. //_8
. tabulate hospital outcome [fweight = count], row col
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}        outcome
  hospital {c |}   failure    success {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    better {c |}{res}        50         50 {txt}{c |}{res}       100 
           {txt}{c |}{res}     50.00      50.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     60.98      42.37 {txt}{c |}{res}     50.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
    normal {c |}{res}        32         68 {txt}{c |}{res}       100 
           {txt}{c |}{res}     32.00      68.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     39.02      57.63 {txt}{c |}{res}     50.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        82        118 {txt}{c |}{res}       200 
           {txt}{c |}{res}     41.00      59.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 
{txt}
{com}. //_9
. graph bar [fweight = count], over(outcome) by(hospital) title(Hospital Outcomes) scheme(michigan)
{res}{txt}
{com}. //_10
. graph export bivariategraph.png, width(500) replace
{txt}(file bivariategraph.png written in PNG format)

{com}. //_11
. bysort severity: tabulate hospital outcome [fweight = count], row col

{txt}{hline}
-> severity = less severe

{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}        outcome
  hospital {c |}   failure    success {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    better {c |}{res}         2         18 {txt}{c |}{res}        20 
           {txt}{c |}{res}     10.00      90.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     11.11      21.95 {txt}{c |}{res}     20.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
    normal {c |}{res}        16         64 {txt}{c |}{res}        80 
           {txt}{c |}{res}     20.00      80.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     88.89      78.05 {txt}{c |}{res}     80.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        18         82 {txt}{c |}{res}       100 
           {txt}{c |}{res}     18.00      82.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 

{txt}{hline}
-> severity = more severe

{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 2}{it:row percentage}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}        outcome
  hospital {c |}   failure    success {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
    better {c |}{res}        48         32 {txt}{c |}{res}        80 
           {txt}{c |}{res}     60.00      40.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     75.00      88.89 {txt}{c |}{res}     80.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
    normal {c |}{res}        16          4 {txt}{c |}{res}        20 
           {txt}{c |}{res}     80.00      20.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}     25.00      11.11 {txt}{c |}{res}     20.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        64         36 {txt}{c |}{res}       100 
           {txt}{c |}{res}     64.00      36.00 {txt}{c |}{res}    100.00 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 

{txt}
{com}. //_12
. graph bar [fweight = count] if severity == "less severe", ///
> title(Less Severe) ///
> over(outcome) ///
> by(hospital) ////
> scheme(michigan) ///
> name(lesssevere, replace)
{res}{txt}
{com}. //_13
. graph bar [fweight = count] if severity == "more severe", ///
> title(More Severe) ///
> over(outcome) ///
> by(hospital) ///
> scheme(michigan) ///
> name(moresevere, replace)
{res}{txt}
{com}. //_14
. graph combine lesssevere moresevere, title(Hospital Outcomes) scheme(michigan)
{res}{txt}
{com}. //_15
. graph export multivariategraph.png, width(1000) replace
{txt}(file multivariategraph.png written in PNG format)

{com}. //_16
. table hospital outcome [fweight=count], by(severity) 

{txt}{hline 12}{c TT}{hline 17}
severity    {c |}
and         {c |}     outcome     
hospital    {c |} failure  success
{hline 12}{c +}{hline 17}
less severe {c |}
     better {c |}       {res}2       18
     {txt}normal {c |}      {res}16       64
{txt}{hline 12}{c +}{hline 17}
more severe {c |}
     better {c |}      {res}48       32
     {txt}normal {c |}      {res}16        4
{txt}{hline 12}{c BT}{hline 17}

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/newstuff/categorical/contingency-tables/simpsons-paradox-hospital-data/simpsons-paradox-hospital-data.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Sep 2020, 08:46:52
{txt}{.-}
{smcl}
{txt}{sf}{ul off}